[
    { "id": 1, "title": "Corporate Website", "category": "design", "image": "assets/images/work1.jpg", "description": "A complete redesign of the corporate website for TechCorp, focusing on a clean user interface and improved user experience. The goal was to increase engagement and provide clear pathways to product information.", "process": "The process involved user research, wireframing, prototyping in Figma, and development using modern web technologies. We conducted A/B testing on key pages to optimize conversion rates." },
    { "id": 2, "title": "Nature Shots", "category": "photography", "image": "assets/images/work2.jpg", "description": "A collection of high-resolution photographs capturing the beauty of nature. This project showcases skills in composition, lighting, and post-processing.", "process": "Shot on a Sony A7III with various lenses. Edited in Adobe Lightroom and Photoshop to enhance natural colors and textures." },
    { "id": 3, "title": "Startup Branding", "category": "branding", "image": "assets/images/work3.jpg", "description": "Developed a full brand identity for a new startup, including logo design, color palette, typography, and marketing materials.", "process": "Started with a discovery phase to understand the brand's values, followed by concept sketching, digital rendering in Adobe Illustrator, and creating a comprehensive brand style guide." },
    { "id": 4, "title": "E-commerce App", "category": "design", "image": "assets/images/work4.jpg", "description": "Designed the user interface and user experience for a mobile e-commerce application. The design prioritizes intuitive navigation and a seamless checkout process.", "process": "Created user flows, wireframes, and high-fidelity mockups. Conducted usability testing with interactive prototypes to refine the design before handoff to the development team." },
    { "id": 5, "title": "Urban Exploration", "category": "photography", "image": "assets/images/work5.jpg", "description": "A photographic series exploring the architecture and street life of urban environments. The collection focuses on capturing candid moments and unique perspectives.", "process": "Utilized a combination of street photography techniques and architectural photography principles. Post-production focused on creating a consistent, atmospheric mood across the series." },
    { "id": 6, "title": "Logo System", "category": "branding", "image": "assets/images/work6.jpg", "description": "Designed a flexible and scalable logo system for a brand with multiple sub-products. The system ensures brand consistency while allowing for individual product identity.", "process": "The project involved extensive research into the brand's architecture, followed by the development of a core brand mark and a set of rules for creating sub-brand logos." }
]